Revit 2024 API
DuctPressureDropData.WidthOrDiameter Property
 The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double WidthOrDiameter { get; }
Visual Basic
Public ReadOnly Property WidthOrDiameter As Double
	Get
Visual C++
public:
property double WidthOrDiameter {
	double get ();
}
See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace